import openIcon from "../../styles/icons/open.svg";
import closeIcon from "../../styles/icons/close.svg";
import React, { useState } from "react";
import "./style.scss";

const dataCollection = [
  {
    question:
      "Подтверждено: сознание наших соотечественников не замутнено пропагандой?",
    answer:
      "В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.",
  },
  {
    question: "Прототип нового сервиса - это как трубный призыв?",
    answer:
      "В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.",
  },
  {
    question: "Частокол на границе продолжает удивлять?",
    answer:
      "В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.",
  },
  {
    question: "Очевидцы сообщают, что слышали грохот грома градущих изменений?",
    answer:
      "В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.",
  },
  {
    question:
      "И по сей день в центральных регионах звучит перекатами печальный плач оппозиции?",
    answer:
      "В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.",
  },
  {
    question:
      "Нынче никто не может себе позволить инициировать треск разлетающихся скреп?",
    answer:
      "В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.",
  },
  {
    question: "Высококачественный прототип будущего проекта обнадёживает?",
    answer:
      "В частности, дальнейшее развитие различных форм деятельности позволяет выполнить важные задания по разработке дальнейших направлений развития. Предварительные выводы неутешительны: экономическая повестка сегодняшнего дня говорит о возможностях существующих финансовых и административных условий.",
  },
];

export default function Accordion() {
  const [accordion, setActiveAccordion] = useState(-1);

  function toggleAccordion(index) {
    if (index === accordion) {
      setActiveAccordion(-1);
      return;
    }
    setActiveAccordion(index);
  }
  return (
    <>
      <div className="faq__container">
        <div>
          <h2>Вопросы и ответы</h2>
        </div>
        <div className="accordion__faq">
          {dataCollection.map((item, index) => (
            <div key={index} onClick={() => toggleAccordion(index)}>
              <div className={"accordoin__faq-heading"}>
                <p>{item.question}</p>
                <div className="accordoin__faq-icon">
                  {accordion === index ? (
                    <>
                      <img src={closeIcon} />
                    </>
                  ) : (
                    <>
                      <img src={openIcon} />
                    </>
                  )}
                </div>
              </div>
              <div className="accordion__faq-answer">
                <p className={accordion === index ? "active" : "inactive"}>
                  {item.answer}
                </p>
              </div>
            </div>
          ))}
        </div>
      </div>
    </>
  );
}
